import React from 'react';
import Layout from './Layout';
import useDocumentTitle from './huks.js/useDocumentTitle';
import './css/style/politic.css'

const Politic = () => {
  useDocumentTitle('Политика конфиденциальности');

  return (
      <Layout>
        <div className="scroll-container">
          <h2>Политика в отношении обработки персональных данных</h2>
          <ol class="nested-list">
            <li><b>Общие положения</b>
            <p>Настоящая политика обработки персональных данных составлена в соответствии с требованиями Федерального закона от 27.07.2006. № 152-ФЗ "О персональных данных" (далее — Закон о персональных данных) и определяет порядок обработки персональных данных и меры по обеспечению безопасности персональных данных. Предпринимает их <samp>SkillVibe</samp>.</p>
              <ol>
                <li><samp>SkillVibe</samp> ставит своей важнейшей целью и условием осуществления своей деятельности соблюдение прав и свобод человека и гражданина при обработке его персональных данных, в том числе защиты прав на неприкосновенность частной жизни, личную и семейную тайну.</li>
                <li>Настоящая политика Оператора в отношении обработки персональных данных (далее — Политика) применяется ко всей информации, которую Оператор может получить о посетителях сайта <samp>https://inseliq.github.io/skillvibe/.</samp></li>
              </ol>
            </li>
            <li><b>Основные понятия, используемые в Политике</b>
              <ol>
                <li>Автоматизированная обработка персональных данных — обработка персональных данных с помощью средств вычислительной техники.</li>
                <li>Блокирование персональных данных — временное прекращение обработки персональных данных (за исключением случаев, если обработка необходима для уточнения персональных данных).</li>
                <li>Сайт — совокупность графических и информационных материалов, а также программ для ЭВМ и баз данных, обеспечивающих их доступность в сети интернет по сетевому адресу <samp>https://inseliq.github.io/skillvibe/.</samp></li>
                <li>Информационная система персональных данных — совокупность содержащихся в базах данных персональных данных и обеспечивающих их обработку информационных технологий и технических средств.</li>
                <li>Обезличивание персональных данных — действия, в результате которых невозможно определить без использования дополнительной информации принадлежность персональных данных конкретному Пользователю или иному субъекту персональных данных.</li>
                <li>Обработка персональных данных — любое действие (операция) или совокупность действий (операций), совершаемых с использованием средств автоматизации или без использования таких средств с персональными данными, включая сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление, уничтожение персональных данных.</li>
                <li><sapm>SkillVibe</sapm> — Самостоятельно или совместно с другими лицами организующие и осуществляющие обработку персональных данных, а также определяющие цели обработки персональных данных, состав персональных данных, подлежащих обработке, действия (операции), совершаемые с персональными данными.</li>
                <li>Персональные данные — любая информация, относящаяся прямо или косвенно к определенному или определяемому Пользователю сайта <samp>https://inseliq.github.io/skillvibe/.</samp></li>
                <li>Пользователь — любой посетитель сайта <sapm>https://inseliq.github.io/skillvibe/.</sapm></li>
                <li>Предоставление персональных данных — действия, направленные на раскрытие персональных данных определенному лицу или определенному кругу лиц.</li>
                <li>Уничтожение персональных данных — любые действия, в результате которых персональные данные уничтожаются безвозвратно с невозможностью дальнейшего восстановления содержания персональных данных в информационной системе персональных данных и/или уничтожаются материальные носители персональных данных.</li>
              </ol>
            </li>
            <li><b>Принципы обработки персональных данных</b>
              <ol>
                <li>Обработка персональных данных осуществляется на законной и справедливой основе.</li>
                <li>Не допускается объединение баз данных, содержащих персональные данные, обработка которых осуществляется в целях, несовместимых между собой.</li>
                <li>Не происходит передачи персональных данных при получении пользователем промокодов, купонов или иных акций и скидок на сторонних ресурсах.</li>
              </ol>
            </li>
            <li><b>Условия обработки персональных данных</b>
              <ol>
                <li>Обработка персональных данных осуществляется с согласия субъекта персональных данных на обработку его персональных данных.</li>
                <li>Обработка персональных данных необходима для осуществления прав и законных интересов оператора или третьих лиц либо для достижения общественно значимых целей при условии, что при этом не нарушаются права и свободы субъекта персональных данных.</li>
                <li>Осуществляется обработка персональных данных, подлежащих опубликованию или обязательному раскрытию в соответствии с федеральным законом.</li>
              </ol>
            </li>
            <li><b>Порядок сбора, хранения, передачи и других видов обработки персональных данных</b>
            <p>Безопасность персональных данных, которые обрабатываются Оператором, обеспечивается путем реализации правовых, организационных и технических мер, необходимых для выполнения в полном объеме требований действующего законодательства в области защиты персональных данных.</p>
              <ol>
                <li>В случае выявления неточностей в персональных данных, Пользователь может актуализировать их самостоятельно, путем направления Оператору сообщение в телеграме <samp>@ncuxoseeliq</samp> с пометкой "Актуализация персональных данных".</li>
                <li>Срок обработки персональных данных определяется достижением целей, для которых были собраны персональные данные, если иной срок не предусмотрен договором или действующим законодательством.
                  <p className='notUp'>Пользователь может в любой момент отозвать свое согласие на обработку персональных данных, направив Оператору уведомление посредством сообщения в телеграме Оператора <samp>@ncuxoseeliq</samp> с пометкой "Отзыв согласия на обработку персональных данных".</p>
                </li>
                <li>Условием прекращения обработки персональных данных может являться достижение целей обработки персональных данных, истечение срока действия согласия субъекта персональных данных, отзыв согласия субъектом персональных данных или требование о прекращении обработки персональных данных, а также выявление неправомерной обработки персональных данных.</li>
              </ol>
            </li>
            <li><b>Перечень действий, производимых Оператором с полученными персональными данными</b>
              <ol>
                <li> Оператор осуществляет сбор, запись, систематизацию, накопление, хранение, уточнение (обновление, изменение), извлечение, использование, передачу (распространение, предоставление, доступ), обезличивание, блокирование, удаление и уничтожение персональных данных.</li>
                <li>Оператор осуществляет автоматизированную обработку персональных данных с получением и/или передачей полученной информации по информационно-телекоммуникационным сетям или без таковой.</li>
              </ol>
            </li>
            <li><b>Конфиденциальность персональных данных</b>
              <p>Оператор и иные лица, получившие доступ к персональным данным, обязаны не раскрывать третьим лицам и не распространять персональные данные без согласия субъекта персональных данных, если иное не предусмотрено федеральным законом.</p>
            </li>
            <li><b>Заключительные положения</b>
              <ol>
                <li>Пользователь может получить любые разъяснения по интересующим вопросам, касающимся обработки его персональных данных, обратившись к Оператору с помощью сообщения в телеграме <samp>@ncuxoseeliq.</samp></li>
                <li>В данном документе будут отражены любые изменения политики обработки персональных данных <samp>SakilVibe</samp>. Политика действует бессрочно до замены ее новой версией.</li>
                <li>Актуальная версия Политики в свободном доступе расположена в сети Интернет по адресу <samp>https://inseliq.github.io/skillvibe/politic.</samp></li>
              </ol>
            </li>
          </ol>
          <p className='mt'>Обновлено 21:00 05.02.2025</p>
        </div>
      </Layout>
  );
};

export default Politic;